app/views/spaces/location.html.erb

SELECT  "spaces".* FROM "spaces" WHERE "spaces"."location" = ? LIMIT ?  [["location", "b2"], ["LIMIT", 1]]
---
      <% @button_id = "#{row}-#{col}" %>
      <% @grid_location = Space.find_by(location: @button_id) %>