app/views/spaces/loser.html.erb

      <% @button_id = "#{row}-#{col}" %>
      <% @grid_location = Space.find_by(location: @button_id) %>
---
SELECT  "spaces".* FROM "spaces" WHERE "spaces"."location" = ? LIMIT ?  [["location", "0-0"], ["LIMIT", 1]]