app/controllers/spaces_controller.rb

SELECT  "grids".* FROM "grids" ORDER BY "grids"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def new
    # byebug
    @grid = Grid.last

SELECT  "spaces".* FROM "spaces" WHERE "spaces"."location" = ? LIMIT ?  [["location", "a1"], ["LIMIT", 1]]
---
  def create
    @location = params[:location]
    @space = Space.find_by(location: @location)

SELECT  "spaces".* FROM "spaces" WHERE "spaces"."location" = ? LIMIT ?  [["location", "location=b1"], ["LIMIT", 1]]
---
  def location
    # byebug
    @location = params[:location][-2..-1]
    @space = Space.find_by(location: @location)